{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PERSON",
    "2": "I-PERSON",
    "3": "B-DRUG",
    "4": "I-DRUG",
    "5": "B-CRIME_TIME",
    "6": "I-CRIME_TIME",
    "7": "B-CRIME_LOC",
    "8": "I-CRIME_LOC",
    "9": "B-DRUG_WEIGHT",
    "10": "I-DRUG_WEIGHT",
    "11": "B-CHARGE",
    "12": "I-CHARGE",
    "13": "B-SENTENCE",
    "14": "I-SENTENCE",
    "15": "B-LEGAL_ARTICLE",
    "16": "I-LEGAL_ARTICLE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-CHARGE": 11,
    "B-CRIME_LOC": 7,
    "B-CRIME_TIME": 5,
    "B-DRUG": 3,
    "B-DRUG_WEIGHT": 9,
    "B-LEGAL_ARTICLE": 15,
    "B-PERSON": 1,
    "B-SENTENCE": 13,
    "I-CHARGE": 12,
    "I-CRIME_LOC": 8,
    "I-CRIME_TIME": 6,
    "I-DRUG": 4,
    "I-DRUG_WEIGHT": 10,
    "I-LEGAL_ARTICLE": 16,
    "I-PERSON": 2,
    "I-SENTENCE": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "5.0.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
